[options]
mode bmc
depth 8
timeout 30
append 0

[engines]
smtbmc --nopresat --unroll z3 -- --logic QF_BV

[script]
read_verilog -formal -sv nutshell_pr74_cache_io_idbits_formal.sv
chparam -set BUGGY 0 nutshell_pr74_cache_io_idbits_formal
prep -top nutshell_pr74_cache_io_idbits_formal

[files]
formal/historical/nutshell_pr74_cache_io_idbits_formal.sv
